ADD_WHAT_CONTENT = (
    '你想记录什么内容呢？',
    '你想记下什么？',
    '你想让我帮你记录什么呢？',
    '要记录的内容是？',
)

ADD_SUCCESS = (
    '好的，记下了，ID 是 {id}',
    '记下了，ID 是 {id}',
    '好的，记下了',
)

LIST_EMPTY = (
    '你还没有记录任何笔记',
    '你还没有添加过笔记呢',
    '现在还没有笔记哦',
)

LIST_COMPLETE = (
    '好了，一共就这些',
    '好了，就这 {count} 条',
    '以上就是所有的笔记了',
    '以上就是所有的 {count} 条笔记了',
)

DEL_WHICH_ID = (
    '你想删除的笔记 ID 是多少呢？',
    '你想删除哪条笔记？请输入笔记 ID',
)

DEL_ID_NOT_EXISTS = (
    '你要删除的 ID 好像不存在哦',
    '诶，没找到这个 ID 呢，请检查一下是不是存在哦',
    'ID 为 {id} 的笔记不存在啦，可能之前已经被删掉了哦',
)

DEL_SUCCESS = (
    '笔记 {id} 删除成功啦',
    '好的，我帮你删掉了',
    '好了，已经删掉了',
)

QUERYING_ALL = (
    '稍等一下，我看看啊',
    '我看看哈',
)

DEL_CANNOT_RECOGNIZE_ID = (
    '我看不懂你要删除哪个 ID 呢，请重新输入，建议直接告诉我 ID 的数字哦',
    '不太明白你要删除哪个笔记呢，请重新输入要删除的笔记 ID',
)
